<template>
    <v-container>
        <v-card outlined>
            <v-card-title>
                <span class="title font-weight-light">Порядок работы</span>
            </v-card-title>
            <v-card-text>
                Слева вверху кнопка меню, далее подменю "Публикации". Там откроется таблица, по умолчанию пустая, 
                поскольку публикации загружаются по дате. Даты загруженных публикаций с 24.05.2020 по 08.06.2020. 
                В начале июня публикаций нет, система в этот период не работала.
            </v-card-text>
            <v-card-text>
                Справа вверху над таблицей поле с выбором даты, при нажатии на которое появляется календарь. Там 
                можно выбрать либо две даты, и система выдаст публикации, которые публиковались в этот период, либо 
                одну дату, тогда система выдаст публикации, начиная с этой даты и до конца.
            </v-card-text>
            <v-card-text>
                Внизу таблицы пагинация, то есть переход по страницам. Данные при переходе на страницу загружаются с сервера.
                Также модно указать, по сколько элементов в таблице показывать (15,30,50,100).
            </v-card-text>
            <v-card-text>
                Состояние приложения сохраняется в браузере. Можете перезагружать страницу, закрывать браузер. Фильтр публикаций (даты, 
                страница, по сколько показывать строк) останется.
            </v-card-text>
            <v-card-text>
                В строке таблицы в крайней левой колонке кнопка, которая разворачивает публикацию. Там есть ссылка на ВК на эту публикацию, а
                также текст публикации, количество лайков, репостов, просмотров, комментариев. Если текста нет, значит и в самой публикации его нет, 
                скорее всего фото, видео или ссылка. 
            </v-card-text>
            <v-card-text>
                Крайний правый столбец таблицы содержит три радио кнопки. Левая красная, средняя серая и правая зеленая. Серая - публикация никак не отмечена.
                Зеленая - публикация носит положительный характер. Красная - публикация носит не полдожительный характер (см. ниже). Для отметки просто кликнуть по нужной кнопке. 
            </v-card-text>
            <v-card-title>
                <span class="title font-weight-light">Как определить характер публикации</span>
            </v-card-title>
            <v-card-text>
                К сожалению, для первого эксперимента были выбраны не очень хорошие источники данных, поскольку ряд публикаций носит противоречивый характер. 
                Но приходится пока работать с тем, что есть.
            </v-card-text>
            <v-card-text>
                Итак, мы имеем два класса: "положительный", обозначим его как +1, и "не положительный", обозначим как -1. Класс -1 не подразумевает, что новость там должна быть отрицательной. 
                Туда относится все, что не вошло в класс +1. 
            </v-card-text>
            <v-card-text>    
                В +1 отмечаем:
                <ol>
                    <li>новости, в которых положительный характер явно виден, например "в зоопарке родилась панда". Хоть с какой стороны смотри, а это хорошо</li>
                    <li>новости, чаще всего с Лепры, где выложено фото с юмором, чаще с положительным, например https://vk.com/wall-30022666_332227</li>
                    <li>По коронавирусу только те новости, которые связаны со снятием ограничений, например https://vk.com/wall-24136539_4921339. Новости из серии 
                        "В России число погибших от коронавируса уменьшилось" относим к -1, поскольку с одной стороны, это хорошо, что уменьшилось, но с другой стороны,
                        погибшие то есть
                    </li>
                    <li>публикации такого плана: https://vk.com/wall-2197800_3035511, https://vk.com/wall-2197800_3017154. Когда нет явно негативного содержания</li>
                </ol>
            </v-card-text>
            <v-card-text>
                Все остальное идет в -1. Если над какой то публикацией сомнение, то ее в -1. Всего элементов класса +1 должно быть 30-40%, не больше. 
            </v-card-text>
            <v-card-text>
                Самые сложные публикации - политические. Например, публикация типа "Путин объявил о выплате врачам". С одной стороны, нужно отнести ее в +1, поскольку
                новость положительная. С другой стороны, поскольку народная любовь к национальному лидеру запредельная, то в комментариях пользователи могу обсуждать, 
                насколько президент хорош и соревноваться в выражениях любви к нему. В данном случае новость отностить в -1. Однако если "Путин выплатил врачам, и они это подтвердили",
                то относить в +1. Если сомнения, то в -1.
            </v-card-text>
            <v-card-title>
                <v-icon large left>mdi-thumb-up</v-icon>
                <span class="title font-weight-light">Благодарю за содействие!</span>
            </v-card-title>
        </v-card>
    </v-container>
</template>
<script src="./dashboard.js"></script>